* TEST ZSTRMAC2 ASELECT EXTENSIONS FOR V1,V2,(V3,V4) V=N,C'?',X'??'
&I       SETA 0
.*       AWHILE (&I LE 255)
.AWH_1_T   ANOP
           AIF    (NOT(&I LE 255)).AWH_1_E
.*               ASELECT (&I)
                   AGO   .ASE_1_G
.*               AWHEN 0
.ASE_1_1           ANOP
                        MNOTE 'AWHEN I=0'
.*               AWHEN 1
                   AGO   .ASE_1_E
.ASE_1_2           ANOP
                        MNOTE 'AWHEN I=1'
.*               AWHEN 3,(5,7),9
                   AGO   .ASE_1_E
.ASE_1_3           ANOP
                        MNOTE 'AWHEN I=&I (3,(5,7),9'
.*               AWHEN C'A'
                   AGO   .ASE_1_E
.ASE_1_4           ANOP
                        MNOTE 'AWHEN I=&I EBCIDC CHAR A'
.*               AWHEN C'1',(C'2',C'4'),C'5'
                   AGO   .ASE_1_E
.ASE_1_5           ANOP
                        MNOTE 'AWHEN I=&I EBCIDC CHAR 1,(2,4),5'
.*               AWHEN X'FA',(X'FB',X'FD'),X'FE'
                   AGO   .ASE_1_E
.ASE_1_6           ANOP
                        MNOTE 'AWHEN I=&I EBCIDC HEX FA,(FB,FD),FE'
.*               AWHEN X'FF'
                   AGO   .ASE_1_E
.ASE_1_7           ANOP
                        MNOTE 'AWHEN I=&I EBCIDC HEX FF'
.*               AEND
                   AGO   .ASE_1_E
.ASE_1_G           ANOP
                   AGO   (&I+1-0).ASE_1_1,.ASE_1_2,.ASE_1_E,.ASE_1_3,.AX
               SE_1_E,.ASE_1_3,.ASE_1_3,.ASE_1_3,.ASE_1_E,.ASE_1_3,.ASEX
               _1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1X
               _E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_EX
               ,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.X
               ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASX
               E_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_X
               1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_X
               E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,X
               .ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.AX
               SE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASEX
               _1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1X
               _E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_EX
               ,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.X
               ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASX
               E_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_X
               1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_X
               E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,X
               .ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.AX
               SE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASEX
               _1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1X
               _E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_EX
               ,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.X
               ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASX
               E_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_X
               1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_X
               E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,X
               .ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.AX
               SE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASEX
               _1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1X
               _E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_EX
               ,.ASE_1_E,.ASE_1_E,.ASE_1_4,.ASE_1_E,.ASE_1_E,.ASE_1_E,.X
               ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASX
               E_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_X
               1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_X
               E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,X
               .ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.AX
               SE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASEX
               _1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1X
               _E,.ASE_1_5,.ASE_1_5,.ASE_1_5,.ASE_1_5,.ASE_1_5,.ASE_1_EX
               ,.ASE_1_E,.ASE_1_E,.ASE_1_E,.ASE_1_6,.ASE_1_6,.ASE_1_6,.X
               ASE_1_6,.ASE_1_6,.ASE_1_7
.ASE_1_E           ANOP
&I               SETA &I+1
.*       AEND
           AGO   .AWH_1_T
.AWH_1_E   ANOP
TESTZSM3 CSECT
         SR    15,15
         BR    14
         END

