*********************************************************************
* Copyright 2008 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
*********************************************************************
* 09/17/08 RPI 911 CHANGE ASELECT TO ACASE AND APM TO ACALL
* 09/23/08 RPI 911 new regression test for SPM's
*********************************************************************
         TITLE 'TESTSPE4 - TEST STRUCTURED PROGRAMMING EXTENSIONS'
* TEST ZSTRMAC ERROR MESSAGES
.*       AELSE
 MNOTE 8'ZSTRMAC ERROR MISSING AIF OR ACASE
.*       AELSEIF
 MNOTE 8'ZSTRMAC ERROR AELSEIF MISSING AIF ERROR
.*       AEND
 MNOTE 8'ZSTRMAC ERROR AEND MISSING AIF OR OTHER STRUCTURE
.*       AEXIT AENTRY
 MNOTE 8'ZSTRMAC ERROR AEXIT NOT WITHIN AENTRY, AWHILE, ACASE
.*       AWHEN
 MNOTE 8'ZSTRMAC ERROR AWHEN MISSING ACASE
.*       AIF
 MNOTE 8'ZSTRMAC ERROR AIF EXPRESSION SYNTAX ERROR
.*       AELSEIF
           AGO   .AIF_1_E
.AIF_1_1   ANOP
 MNOTE 8'ZSTRMAC ERROR AELSEIF AIF ERROR
.*       ACALL
 MNOTE 8'ZSTRMAC ERROR ACALL NAME SYNTAX ERROR
.*       ACALL X
&ACALL_1_X SETA    1
           AGO   .ACL_1_X
.ACL_1_1   ANOP
.*       AEXIT AWHILE
 MNOTE 8'ZSTRMAC ERROR AEXIT NOT WITHIN AENTRY, AWHILE, ACASE
.*       AEXIT AUNTIL
 MNOTE 8'ZSTRMAC ERROR AEXIT NOT WITHIN AENTRY, AWHILE, ACASE
.*       AEXIT ACASE
 MNOTE 8'ZSTRMAC ERROR AEXIT NOT WITHIN AENTRY, AWHILE, ACASE
.*       AEND
.AIF_1_2   ANOP
.AIF_1_E   ANOP
.*       ACASE
 MNOTE 8'ZSTRMAC ERROR ACASE EXPRESSION ERROR
&I       SETA 1
.*       ACASE (&I)
           AGO   .ACS_2_G
.*       AWHEN
 MNOTE 8'ZSTRMAC ERROR AWHEN VALUE ERROR
.ACS_2_1   ANOP
.*       AWHEN -1
           AGO   .ACS_2_E
 MNOTE 8'ZSTRMAC ERROR INVALID VALUE
.ACS_2_2   ANOP
.*       AWHEN 256
           AGO   .ACS_2_E
 MNOTE 8'ZSTRMAC ERROR INVALID VALUE
.ACS_2_3   ANOP
.*       AELSE
           AGO   .ACS_2_E
.ACS_2_X   ANOP
.*       AEND
           AGO   .ACS_2_E
.ACS_2_G   ANOP
           AGO   (&I+1-257)
           AGO   .ACS_2_X
.ACS_2_E   ANOP
.*       AENTRY
 MNOTE 8'ZSTRMAC ERROR AENTRY NAME NOT FOUND
.*       AENTRY Y
           AGO   .ACL_2_SKIP
.ACL_2_Y   ANOP
.*       AEXIT
 MNOTE 8'ZSTRMAC ERROR AEXIT TYPE PARM NOT FOUND
.*       AEND
 MNOTE 8'ZSTRMAC ERROR AENTRY Y NOT USED
.ACL_2_SKIP ANOP
         END
 MNOTE 8'ZSTRMAC ERROR MISSING AENTRY FOR X
