* TEST ZSTRMAC ERROR MESSAGES
.*       AELSE
 MNOTE 8'ZSTRMAC ERROR MISSING AIF OR ASELECT
.*       AELSEIF
 MNOTE 8'ZSTRMAC ERROR AELSEIF MISSING AIF ERROR
.*       AEND
 MNOTE 8'ZSTRMAC ERROR AEND MISSING AIF OR OTHER STRUCTURE
.*       AEXIT AENTRY
 MNOTE 8'ZSTRMAC ERROR AEXIT NOT WITHIN AENTRY, AWHILE, ASELECT
.*       AWHEN
 MNOTE 8'ZSTRMAC ERROR AWHEN MISSING ASELECT
.*       AIF
 MNOTE 8'ZSTRMAC ERROR AIF EXPRESSION SYNTAX ERROR
.*       AELSEIF
           AGO   .AIF_1_E
.AIF_1_1   ANOP
 MNOTE 8'ZSTRMAC ERROR AELSEIF AIF ERROR
.*       APM
 MNOTE 8'ZSTRMAC ERROR APM NAME SYNTAX ERROR
.*       APM X
&APM_1_X   SETA    1
           AGO   .APM_1_X
.APM_1_1   ANOP
.*       AEXIT AWHILE
 MNOTE 8'ZSTRMAC ERROR AEXIT NOT WITHIN AENTRY, AWHILE, ASELECT
.*       AEXIT AUNTIL
 MNOTE 8'ZSTRMAC ERROR AEXIT NOT WITHIN AENTRY, AWHILE, ASELECT
.*       AEXIT ASELECT
 MNOTE 8'ZSTRMAC ERROR AEXIT NOT WITHIN AENTRY, AWHILE, ASELECT
.*       AEND
.AIF_1_2   ANOP
.AIF_1_E   ANOP
.*       ASELECT
 MNOTE 8'ZSTRMAC ERROR ASELECT EXPRESSION ERROR
&I       SETA 1
.*       ASELECT (&I)
           AGO   .ASE_2_G
.*       AWHEN
 MNOTE 8'ZSTRMAC ERROR AWHEN VALUE ERROR
.ASE_2_1   ANOP
.*       AWHEN -1
           AGO   .ASE_2_E
 MNOTE 8'ZSTRMAC ERROR INVALID VALUE
.ASE_2_2   ANOP
.*       AWHEN 256
           AGO   .ASE_2_E
 MNOTE 8'ZSTRMAC ERROR INVALID VALUE
.ASE_2_3   ANOP
.*       AELSE
           AGO   .ASE_2_E
.ASE_2_X   ANOP
.*       AEND
           AGO   .ASE_2_E
.ASE_2_G   ANOP
           AGO   (&I+1-257)
           AGO   .ASE_2_X
.ASE_2_E   ANOP
.*       AENTRY
 MNOTE 8'ZSTRMAC ERROR AENTRY NAME NOT FOUND
.*       AENTRY Y
           AGO   .APM_2_SKIP
.APM_2_Y   ANOP
.*       AEXIT
 MNOTE 8'ZSTRMAC ERROR AEXIT TYPE PARM NOT FOUND
.*       AEND
 MNOTE 8'ZSTRMAC ERROR AENTRY Y NOT USED
.APM_2_SKIP ANOP
         END
 MNOTE 8'ZSTRMAC ERROR MISSING AENTRY FOR X
